Revit 2027 API
CeramicType Enumeration
 The enumerated type representing the permitted values for the asset property "CeramicType" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CeramicType
Public Enumeration CeramicType
public enum class CeramicType
type CeramicType
Members
Member name | Value | Description
Ceramic | 0
Porcelain | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace